{
  "title": "M-Fundi Loyalty Programme Terms and Conditions",
  "sections": [
    {
      "title": "1. Introduction",
      "content": "These Terms and Conditions govern the M-Fundi Loyalty Programme (\"Programme\") operated by Metsec Cables Ltd, a company registered in Kenya with its registered office at P.O. Box 75963-00200, Mombasa Road, Nairobi, Kenya (\"Metsec\"). By participating in the Programme, you agree to be bound by these Terms and Conditions. The Programme is subject to the laws of Kenya, including the Consumer Protection Act, 2012, and other applicable regulations. The Programme is available only for use within Kenya."
    },
    {
      "title": "2. Eligibility",
      "content": "2.1 The Programme is open to individuals selling or using Metsec Cables Ltd products for professional or commercial use in Kenya, who are at least 18 years old at the time of enrollment.\n2.2 Employees, affiliates, or immediate family members of Metsec Cables Ltd are not eligible to participate.\n2.3 Participation is subject to Metsec's sole discretion and approval."
    },
    {
      "title": "3. Enrollment",
      "content": "3.1 To join the Programme, eligible participants must register through the designated M-Fundi platform (e.g., website, mobile app, or physical form provided by Metsec).\n3.2 Registration requires providing accurate personal or business details, including but not limited to name, contact information, and proof of purchase where applicable.\n3.3 Metsec reserves the right to reject or terminate any enrollment without providing reasons, subject to compliance with Kenyan law.\n3.4 By enrolling in the Programme, participants consent to sharing their geo-location data with Metsec for Programme-related purposes."
    },
    {
      "title": "4. Programme Structure",
      "content": "4.1 The M-Fundi Loyalty Programme is a discretionary rewards scheme where participants may earn Stima points, discounts, or other benefits (\"Rewards\") by scanning QR codes found on eligible Metsec Cables Ltd products after purchase.\n\n4.2 Rewards are granted at Metsec's sole discretion and may vary based on the type of product scanned, volume of valid scans, or promotional campaigns. Rewards will only be issued upon successful QR code verification.\n\n4.3 Stima points or Rewards have no cash value and cannot be transferred, sold, or exchanged unless explicitly permitted by Metsec."
    },
    {
      "title": "5. Redemption of Rewards",
      "content": "5.1 Rewards may be redeemed for gifts, services, or other benefits as specified by Metsec at the time of redemption. \n5.2 Redemption is subject to availability and any additional terms communicated at the time of redemption. \n5.3 Rewards cannot be redeemed for cash. 5.4 Metsec reserves the right to impose limits on Reward redemption, including minimum or maximum thresholds, in accordance with Kenyan law."
    },
    {
      "title": "6. Termination and Suspension",
      "content": "6.1 Metsec may suspend or terminate a participant’s membership or the Programme itself at its sole discretion, with or without notice, subject to applicable Kenyan laws.\n6.2 Grounds for termination of membership include, but are not limited to, fraudulent activity, misuse of Rewards, or breach of these Terms and Conditions.\n6.3 Upon termination of membership or the Programme, all unredeemed Rewards will be forfeited without compensation unless otherwise required by law.\n6.4 Participants may voluntarily withdraw from the Programme by notifying Metsec in writing, after which all Rewards will be forfeited.\n6.5 Fraudulent or Duplicate ScansParticipants must not attempt to earn Stima points through duplicate scanning of the same QR code or by using codes obtained unlawfully. Any suspected fraud, misuse, or system manipulation — including multiple scans of a single product — may result in suspension or permanent removal from the Programme, at Metsec’s sole discretion."
    },
    {
      "title": "7. Privacy and Data Protection",
      "content": "7.1 Personal data collected during enrollment or participation will be processed in accordance with the Data Protection Act, 2019 of Kenya. \n7.2 Metsec will use participant data for Programme administration, marketing, and related purposes, with consent where required by law. By participating in the Programme, participants consent to receiving marketing materials from Metsec.\n7.3 Participants may request access to or correction of their personal data by contacting Metsec at the registered address or through designated communication channels."
    },
    {
      "title": "8. Limitation of Liability",
      "content": "8.1 To the extent permitted by Kenyan law, Metsec shall not be liable for any loss, damage, or inconvenience arising from participation in the Programme, including but not limited to the suspension, termination, or modification of the Programme or Rewards.\n8.2 Metsec does not guarantee the availability of specific Rewards or the continued operation of the Programme."
    },
    {
      "title": "9. Amendments",
      "content": "9.1 Metsec reserves the right to amend these Terms and Conditions at any time, with notice provided to participants through reasonable means (e.g., email, website updates, or other communication channels).\n9.2 Continued participation in the Programme after amendments constitutes acceptance of the revised Terms and Conditions."
    },
    {
      "title": "10. Governing Law and Dispute Resolution",
      "content": "10.1 These Terms and Conditions are governed by the laws of the Republic of Kenya.\n10.2 Any disputes arising from the Programme shall first be addressed through good-faith negotiations between the participant and Metsec.\n10.3 If unresolved, disputes shall be referred to mediation or arbitration in accordance with the Arbitration Act, 1995, or resolved through the courts of Kenya with jurisdiction in Nairobi."
    },
    {
      "title": "11. Miscellaneous",
      "content": "11.1 The Programme is void where prohibited by law.\n11.2 If any provision of these Terms and Conditions is found to be invalid or unenforceable, the remaining provisions shall remain in full force and effect.\n11.3 These Terms and Conditions constitute the entire agreement between Metsec and participants regarding the Programme."
    }
  ],
  "contact_info": {
    "description": "For inquiries or complaints regarding the Programme, contact Metsec Cables Ltd at:",
    "address": "P.O. Box 75963-00200, Mombasa Road, Nairobi, Kenya",
    "email": "marketing@doshigroup.com",
    "phone": "0703 030000"
  }
}